_drafts/boost.org
#+EXPORT_FILE_NAME: 2019-08-31-boost.html
#+TITLE: Boost
#+KEYWORDS: 
#+subtitle: 
#+DATE: <2019-08-31 Sat>

* Tutorial
- [[https://riptutorial.com/boost][Getting started with boost]]
- [[https://theboostcpplibraries.com/][The Boost C++ Libraries]]-book. Soure code: https://github.com/BorisSchaeling/theboostcpplibraries


* Intoduction
** Boost includes

#+begin_example
String and text processing
Containers
Iterators
Algorithms
Function objects and higher-order programming
Generic Programming
Template Metaprogramming
Preprocessor Metaprogramming
Concurrent Programming
Math and numerics
Correctness and testing
Data structures
Image processing
Input/Output
Inter-language support
Memory
Parsing
Programming Interfaces
Miscellaneous
Broken compiler workarounds
#+end_example

** Boost Libraries
#+begin_example
Boost.Chrono
Boost.Context
Boost.Filesystem
Boost.GraphParallel
Boost.IOStreams
Boost.Locale
Boost.MPI
Boost.ProgramOptions
Boost.Python
Boost.Regex
Boost.Serialization
Boost.Signals
Boost.System
Boost.Thread
Boost.Timer
Boost.Wave
Boost.DateTime
Boost.Graph
Boost.Math
Boost.Random
Boost.Test
Boost.Exception
#+end_example

* Compile and Install
** Install from source code
Read: https://github.com/boostorg/boost/wiki/Getting-Started%3A-Overview

#+begin_example sh
git clone --recursive https://github.com/boostorg/boost.git
cd boost
git checkout develop # or whatever branch you want to use
./bootstrap.sh --prefix=<ABSOLUTE_INSTALL_PATH>
./b2 install
#+end_example

** Install from deb
#+begin_example
sudo apt-get install libboost-all-dev
#+end_example
* Getting Started
** Header
you can include Boost headers in C++ files with 

#+begin_example cpp
#include <boost/header/path.hpp> 
#+end_example
** CMakefileLists

[[https://cmake.org/cmake/help/v3.8/module/FindBoost.html][FindBoost]]

#+begin_example sh
cmake_minimum_required(VERSION 3.7)
project(your_project)

set(CMAKE_CXX_FLAGS "${CMAKE_CXX_FLAGS} -std=c++11")
set(SOURCE_FILES main.cpp tmap.cpp tmap.h)
find_package(Boost 1.71 COMPONENTS serialization HINTS "<BOOST_ROOT>")

if (Boost_FOUND)
    include_directories(${Boost_INCLUDE_DIRS})
    add_executable(YourTarget ${SOURCE_FILES})
    target_link_libraries(your_target ${Boost_LIBRARIES} -missing_libs)        
endif()
  
#+end_example
** First Example

example.cpp:
#+begin_src cpp
#include <boost/lambda/lambda.hpp>
#include <iostream>
#include <iterator>
#include <algorithm>

int main()
{
    using namespace boost::lambda;
    typedef std::istream_iterator<int> in;

    std::for_each(
        in(std::cin), in(), std::cout << (_1 * 3) << " " );
}
#+end_src

Compile
#+begin_example
c++ -I ~/data/software/boost -std=c++14 example.cpp
#+end_example
** Mean Covariance Example
#+header: :exports mean-covariance
#+begin_src cpp
#include <iostream>
#include <boost/accumulators/accumulators.hpp>
#include <boost/accumulators/statistics/stats.hpp>
#include <boost/accumulators/statistics/mean.hpp>
#include <boost/accumulators/statistics/variance.hpp>
   
int main()
{
  using namespace boost::accumulators;
  accumulator_set<int, stats<tag::mean, tag::variance>> acc;

  for(int i = 1; i <= 6; i++)
    acc(i);

  std::cout << "mean=" << mean(acc) << ", variance=" << variance(acc) << '\n';
  // prints "mean=3.5, variance=2.91667"

  return 0;
}
#+end_src

* Smart Pointers

The standard library has included the smart pointer =std::auto_ptr= since C++98, but since C++11, =std::auto_ptr= has been deprecated. With C++11, new and better smart pointers were introduced in the standard library. =std::shared_ptr= and =std::weak_ptr= originate from Boost.SmartPointers and are called boost::shared_ptr and boost::weak\_ptr in this library. There is no counterpart to std::unique\_ptr. However, Boost.SmartPointers provides four additional smart pointers – boost::scoped\_ptr, boost::scoped\_array, boost::shared\_array, and boost::intrusive_ptr – which are not in the standard library.
