_posts/2019-08-31-boost.html
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org2526894">1. Tutorial</a></li>
<li><a href="#org89fb073">2. Intoduction</a>
<ul>
<li><a href="#org8de4e73">2.1. Boost includes</a></li>
<li><a href="#org2759f09">2.2. Boost Libraries</a></li>
</ul>
</li>
<li><a href="#org909c6b0">3. Compile and Install</a>
<ul>
<li><a href="#orge90e2da">3.1. Install from source code</a></li>
<li><a href="#org4721cc0">3.2. Install from deb</a></li>
</ul>
</li>
<li><a href="#org3d6293e">4. Getting Started</a>
<ul>
<li><a href="#org5ad2116">4.1. Header</a></li>
<li><a href="#orgac63b80">4.2. CMakefileLists</a></li>
<li><a href="#org063f03c">4.3. First Example</a></li>
<li><a href="#orge857d54">4.4. Mean Covariance Example</a></li>
</ul>
</li>
<li><a href="#orgf227360">5. Smart Pointers</a>
<ul>
<li><a href="#orga282aac">5.1. <code>boost::scoped_ptr</code></a></li>
<li><a href="#org141a50a">5.2. <code>boost::scoped_array</code></a></li>
</ul>
</li>
<li><a href="#org4aded6f">6. Data Structures</a>
<ul>
<li><a href="#org6e81129">6.1. Lexical Cast</a></li>
<li><a href="#orga7d22d6">6.2. variant</a></li>
<li><a href="#org688d557">6.3. Any</a></li>
<li><a href="#orgb964102">6.4. optional</a></li>
</ul>
</li>
<li><a href="#org18bcaef">7. Parallel Programming</a>
<ul>
<li><a href="#orgd70fadb">7.1. Boost.Thread</a></li>
<li><a href="#orga274b6d">7.2. Boost.Atomic</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org2526894" class="outline-2">
<h2 id="org2526894"><span class="section-number-2">1</span> Tutorial</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li><a href="https://riptutorial.com/boost">Getting started with boost</a></li>
<li><a href="https://theboostcpplibraries.com/">The Boost C++ Libraries</a>-book. Soure code: <a href="https://github.com/BorisSchaeling/theboostcpplibraries">https://github.com/BorisSchaeling/theboostcpplibraries</a></li>
</ul>
</div>
</div>


<div id="outline-container-org89fb073" class="outline-2">
<h2 id="org89fb073"><span class="section-number-2">2</span> Intoduction</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org8de4e73" class="outline-3">
<h3 id="org8de4e73"><span class="section-number-3">2.1</span> Boost includes</h3>
<div class="outline-text-3" id="text-2-1">
<pre class="example">
<code>String and text processing</code>
<code>Containers</code>
<code>Iterators</code>
<code>Algorithms</code>
<code>Function objects and higher-order programming</code>
<code>Generic Programming</code>
<code>Template Metaprogramming</code>
<code>Preprocessor Metaprogramming</code>
<code>Concurrent Programming</code>
<code>Math and numerics</code>
<code>Correctness and testing</code>
<code>Data structures</code>
<code>Image processing</code>
<code>Input/Output</code>
<code>Inter-language support</code>
<code>Memory</code>
<code>Parsing</code>
<code>Programming Interfaces</code>
<code>Miscellaneous</code>
<code>Broken compiler workarounds</code>
</pre>
</div>
</div>

<div id="outline-container-org2759f09" class="outline-3">
<h3 id="org2759f09"><span class="section-number-3">2.2</span> Boost Libraries</h3>
<div class="outline-text-3" id="text-2-2">
<pre class="example">
<code>Boost.Chrono</code>
<code>Boost.Context</code>
<code>Boost.Filesystem</code>
<code>Boost.GraphParallel</code>
<code>Boost.IOStreams</code>
<code>Boost.Locale</code>
<code>Boost.MPI</code>
<code>Boost.ProgramOptions</code>
<code>Boost.Python</code>
<code>Boost.Regex</code>
<code>Boost.Serialization</code>
<code>Boost.Signals</code>
<code>Boost.System</code>
<code>Boost.Thread</code>
<code>Boost.Timer</code>
<code>Boost.Wave</code>
<code>Boost.DateTime</code>
<code>Boost.Graph</code>
<code>Boost.Math</code>
<code>Boost.Random</code>
<code>Boost.Test</code>
<code>Boost.Exception</code>
</pre>
</div>
</div>
</div>

<div id="outline-container-org909c6b0" class="outline-2">
<h2 id="org909c6b0"><span class="section-number-2">3</span> Compile and Install</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-orge90e2da" class="outline-3">
<h3 id="orge90e2da"><span class="section-number-3">3.1</span> Install from source code</h3>
<div class="outline-text-3" id="text-3-1">
<p>
Read: <a href="https://github.com/boostorg/boost/wiki/Getting-Started%3A-Overview">https://github.com/boostorg/boost/wiki/Getting-Started%3A-Overview</a>
</p>

<pre class="example">
<code>git clone --recursive https://github.com/boostorg/boost.git</code>
<code>cd boost</code>
<code>git checkout develop # or whatever branch you want to use</code>
<code>./bootstrap.sh --prefix=&lt;ABSOLUTE_INSTALL_PATH&gt;</code>
<code>./b2 install</code>
</pre>
</div>
</div>

<div id="outline-container-org4721cc0" class="outline-3">
<h3 id="org4721cc0"><span class="section-number-3">3.2</span> Install from deb</h3>
<div class="outline-text-3" id="text-3-2">
<pre class="example">
<code>sudo apt-get install libboost-all-dev</code>
</pre>
</div>
</div>
</div>
<div id="outline-container-org3d6293e" class="outline-2">
<h2 id="org3d6293e"><span class="section-number-2">4</span> Getting Started</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-org5ad2116" class="outline-3">
<h3 id="org5ad2116"><span class="section-number-3">4.1</span> Header</h3>
<div class="outline-text-3" id="text-4-1">
<p>
you can include Boost headers in C++ files with 
</p>

<pre class="example">
<code>#include &lt;boost/header/path.hpp&gt; </code>
</pre>
</div>
</div>
<div id="outline-container-orgac63b80" class="outline-3">
<h3 id="orgac63b80"><span class="section-number-3">4.2</span> CMakefileLists</h3>
<div class="outline-text-3" id="text-4-2">
<p>
<a href="https://cmake.org/cmake/help/v3.8/module/FindBoost.html">FindBoost</a>
</p>

<pre class="example">
<code>cmake_minimum_required(VERSION 3.7)</code>
<code>project(your_project)</code>
<code></code>
<code>set(CMAKE_CXX_FLAGS "${CMAKE_CXX_FLAGS} -std=c++11")</code>
<code>set(SOURCE_FILES main.cpp tmap.cpp tmap.h)</code>
<code>find_package(Boost 1.71 COMPONENTS serialization HINTS "&lt;BOOST_ROOT&gt;")</code>
<code></code>
<code>if (Boost_FOUND)</code>
<code>    include_directories(${Boost_INCLUDE_DIRS})</code>
<code>    add_executable(YourTarget ${SOURCE_FILES})</code>
<code>    target_link_libraries(your_target ${Boost_LIBRARIES} -missing_libs)        </code>
<code>endif()</code>
<code>  </code>
</pre>
</div>
</div>
<div id="outline-container-org063f03c" class="outline-3">
<h3 id="org063f03c"><span class="section-number-3">4.3</span> First Example</h3>
<div class="outline-text-3" id="text-4-3">
<p>
example.cpp:
</p>
<div class="org-src-container">
<pre class="src src-cpp"><code><span style="color: #F92672;">#include</span> <span style="color: #E6DB74;">&lt;boost/lambda/lambda.hpp&gt;</span></code>
<code><span style="color: #F92672;">#include</span> <span style="color: #E6DB74;">&lt;iostream&gt;</span></code>
<code><span style="color: #F92672;">#include</span> <span style="color: #E6DB74;">&lt;iterator&gt;</span></code>
<code><span style="color: #F92672;">#include</span> <span style="color: #E6DB74;">&lt;algorithm&gt;</span></code>
<code></code>
<code><span style="color: #66D9EF;">int</span> <span style="color: #A6E22E;">main</span>()</code>
<code>{</code>
<code>    <span style="color: #F92672;">using</span> <span style="color: #F92672;">namespace</span> <span style="color: #AE81FF;">boost</span>::<span style="color: #AE81FF;">lambda</span>;</code>
<code>    <span style="color: #F92672;">typedef</span> <span style="color: #AE81FF;">std</span>::<span style="color: #66D9EF;">istream_iterator</span>&lt;<span style="color: #66D9EF;">int</span>&gt; <span style="color: #66D9EF;">in</span>;</code>
<code></code>
<code>    <span style="color: #AE81FF;">std</span>::for_each(</code>
<code>        in(<span style="color: #AE81FF;">std</span>::cin), in(), <span style="color: #AE81FF;">std</span>::cout &lt;&lt; (_1 * 3) &lt;&lt; <span style="color: #E6DB74;">" "</span> );</code>
<code>}</code>
</pre>
</div>

<p>
Compile
</p>
<pre class="example">
<code>c++ -I ~/data/software/boost -std=c++14 example.cpp</code>
</pre>
</div>
</div>
<div id="outline-container-orge857d54" class="outline-3">
<h3 id="orge857d54"><span class="section-number-3">4.4</span> Mean Covariance Example</h3>
<div class="outline-text-3" id="text-4-4">
<div class="org-src-container">
<pre class="src src-cpp"><code><span style="color: #F92672;">#include</span> <span style="color: #E6DB74;">&lt;iostream&gt;</span></code>
<code><span style="color: #F92672;">#include</span> <span style="color: #E6DB74;">&lt;boost/accumulators/accumulators.hpp&gt;</span></code>
<code><span style="color: #F92672;">#include</span> <span style="color: #E6DB74;">&lt;boost/accumulators/statistics/stats.hpp&gt;</span></code>
<code><span style="color: #F92672;">#include</span> <span style="color: #E6DB74;">&lt;boost/accumulators/statistics/mean.hpp&gt;</span></code>
<code><span style="color: #F92672;">#include</span> <span style="color: #E6DB74;">&lt;boost/accumulators/statistics/variance.hpp&gt;</span></code>
<code>   </code>
<code><span style="color: #66D9EF;">int</span> <span style="color: #A6E22E;">main</span>()</code>
<code>{</code>
<code>  <span style="color: #F92672;">using</span> <span style="color: #F92672;">namespace</span> <span style="color: #AE81FF;">boost</span>::<span style="color: #AE81FF;">accumulators</span>;</code>
<code>  <span style="color: #66D9EF;">accumulator_set</span>&lt;<span style="color: #66D9EF;">int</span>, <span style="color: #66D9EF;">stats</span>&lt;<span style="color: #AE81FF;">tag</span>::mean, <span style="color: #AE81FF;">tag</span>::variance&gt;&gt; <span style="color: #FD971F;">acc</span>;</code>
<code></code>
<code>  <span style="color: #F92672;">for</span>(<span style="color: #66D9EF;">int</span> <span style="color: #FD971F;">i</span> = 1; i &lt;= 6; i++)</code>
<code>    acc(i);</code>
<code></code>
<code>  <span style="color: #AE81FF;">std</span>::cout &lt;&lt; <span style="color: #E6DB74;">"mean="</span> &lt;&lt; mean(acc) &lt;&lt; <span style="color: #E6DB74;">", variance="</span> &lt;&lt; variance(acc) &lt;&lt; <span style="color: #E6DB74;">'\n'</span>;</code>
<code>  <span style="color: #75715E;">// </span><span style="color: #75715E;">prints "mean=3.5, variance=2.91667"</span></code>
<code></code>
<code>  <span style="color: #F92672;">return</span> 0;</code>
<code>}</code>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgf227360" class="outline-2">
<h2 id="orgf227360"><span class="section-number-2">5</span> Smart Pointers</h2>
<div class="outline-text-2" id="text-5">
<p>
The standard library has included the smart pointer <code>std::auto_ptr</code> since C++98, but since C++11, <code>std::auto_ptr</code> has been deprecated. With C++11, new and better smart pointers were introduced in the standard library. <code>std::shared_ptr</code> and <code>std::weak_ptr</code> originate from Boost.SmartPointers and are called boost::shared<sub>ptr</sub> and boost::weak\<sub>ptr</sub> in this library. There is no counterpart to std::unique\<sub>ptr</sub>. However, Boost.SmartPointers provides four additional smart pointers – boost::scoped\<sub>ptr</sub>, boost::scoped\<sub>array</sub>, boost::shared\<sub>array</sub>, and boost::intrusive<sub>ptr</sub> – which are not in the standard library.
</p>
</div>
