_posts/2019-08-31-boost.html
<div id="outline-container-orga282aac" class="outline-3">
<h3 id="orga282aac"><span class="section-number-3">5.1</span> <code>boost::scoped_ptr</code></h3>
<div class="outline-text-3" id="text-5-1">
<p>
<code>boost::scoped_ptr</code> is a smart pointer that is the sole owner of a dynamically allocated object. <code>boost::scoped_ptr</code> cannot be copied or moved. This smart pointer is defined in the header file <code>boost/scoped_ptr.hpp</code>.
</p>

<div class="org-src-container">
<pre class="src src-cpp" id="org2baf278"><code><span style="color: #F92672;">#include</span> <span style="color: #E6DB74;">&lt;boost/scoped_ptr.hpp&gt;</span></code>
<code><span style="color: #F92672;">#include</span> <span style="color: #E6DB74;">&lt;iostream&gt;</span></code>
<code></code>
<code><span style="color: #66D9EF;">int</span> <span style="color: #A6E22E;">main</span>()</code>
<code>{</code>
<code>  <span style="color: #AE81FF;">boost</span>::<span style="color: #66D9EF;">scoped_ptr</span>&lt;<span style="color: #66D9EF;">int</span>&gt; <span style="color: #FD971F;">p</span>{<span style="color: #F92672;">new</span> <span style="color: #66D9EF;">int</span>{1}};</code>
<code>  <span style="color: #AE81FF;">std</span>::cout &lt;&lt; *p &lt;&lt; <span style="color: #E6DB74;">'\n'</span>;</code>
<code>  p.reset(<span style="color: #F92672;">new</span> <span style="color: #66D9EF;">int</span>{2});</code>
<code>  <span style="color: #AE81FF;">std</span>::cout &lt;&lt; *p.get() &lt;&lt; <span style="color: #E6DB74;">'\n'</span>;</code>
<code>  p.reset();</code>
<code>  <span style="color: #AE81FF;">std</span>::cout &lt;&lt; <span style="color: #AE81FF;">std</span>::boolalpha &lt;&lt; <span style="color: #F92672;">static_cast</span>&lt;<span style="color: #66D9EF;">bool</span>&gt;(p) &lt;&lt; <span style="color: #E6DB74;">'\n'</span>;</code>
<code>}</code>
</pre>
</div>
</div>
</div>

<div id="outline-container-org141a50a" class="outline-3">
<h3 id="org141a50a"><span class="section-number-3">5.2</span> <code>boost::scoped_array</code></h3>
<div class="outline-text-3" id="text-5-2">
<div class="org-src-container">
<pre class="src src-cpp"><code><span style="color: #F92672;">#include</span> <span style="color: #E6DB74;">&lt;boost/scoped_array.hpp&gt;</span></code>
<code></code>
<code><span style="color: #66D9EF;">int</span> <span style="color: #A6E22E;">main</span>()</code>
<code>{</code>
<code>  <span style="color: #AE81FF;">boost</span>::<span style="color: #66D9EF;">scoped_array</span>&lt;<span style="color: #66D9EF;">int</span>&gt; <span style="color: #FD971F;">p</span>{<span style="color: #F92672;">new</span> <span style="color: #66D9EF;">int</span>[2]};</code>
<code>  *p.get() = 1;</code>
<code>  p[1] = 2;</code>
<code>  p.reset(<span style="color: #F92672;">new</span> <span style="color: #66D9EF;">int</span>[3]);</code>
<code>}</code>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org4aded6f" class="outline-2">
<h2 id="org4aded6f"><span class="section-number-2">6</span> Data Structures</h2>
<div class="outline-text-2" id="text-6">
</div>
<div id="outline-container-org6e81129" class="outline-3">
<h3 id="org6e81129"><span class="section-number-3">6.1</span> Lexical Cast</h3>
<div class="outline-text-3" id="text-6-1">
<p>
Use "boost" lib to Convert DataType
</p>
<div class="org-src-container">
<pre class="src src-C++"><code><span style="color: #F92672;">#include</span> <span style="color: #E6DB74;">&lt;string&gt;</span></code>
<code><span style="color: #F92672;">#include</span> <span style="color: #E6DB74;">&lt;iostream&gt;</span></code>
<code><span style="color: #F92672;">#include</span> <span style="color: #E6DB74;">"boost/lexical_cast.hpp"</span></code>
<code><span style="color: #F92672;">using</span> <span style="color: #AE81FF;">boost</span>::<span style="color: #66D9EF;">lexical_cast</span>;</code>
<code><span style="color: #F92672;">using</span> <span style="color: #AE81FF;">boost</span>::<span style="color: #66D9EF;">bad_lexical_cast</span>;</code>
<code><span style="color: #F92672;">using</span> <span style="color: #F92672;">namespace</span> <span style="color: #AE81FF;">std</span>;</code>
<code><span style="color: #66D9EF;">int</span> <span style="color: #A6E22E;">main</span>(<span style="color: #66D9EF;">int</span> <span style="color: #FD971F;">argc</span>, <span style="color: #66D9EF;">char</span> *<span style="color: #FD971F;">argv</span>[])</code>
<code>{</code>
<code>  <span style="color: #66D9EF;">int</span> <span style="color: #FD971F;">s</span>=23;</code>
<code>  <span style="color: #66D9EF;">string</span> <span style="color: #FD971F;">str</span>=lexical_cast&lt;<span style="color: #66D9EF;">string</span>&gt;(s);</code>
<code>  cout&lt;&lt;<span style="color: #E6DB74;">"int to str: "</span>&lt;&lt;str&lt;&lt;endl;</code>
<code></code>
<code>  str=<span style="color: #E6DB74;">"Message: "</span>+lexical_cast&lt;<span style="color: #66D9EF;">string</span>&gt;(<span style="color: #E6DB74;">'A'</span>)+<span style="color: #E6DB74;">"="</span>+lexical_cast&lt;<span style="color: #66D9EF;">string</span>&gt;(34.5);</code>
<code>  cout&lt;&lt;<span style="color: #E6DB74;">"char and float to str: "</span>&lt;&lt;str&lt;&lt;endl;</code>
<code></code>
<code>  <span style="color: #66D9EF;">array</span>&lt;<span style="color: #66D9EF;">char</span>,64&gt; <span style="color: #FD971F;">msg</span>=lexical_cast&lt;<span style="color: #66D9EF;">array</span>&lt;<span style="color: #66D9EF;">char</span>,64&gt;&gt;(23);</code>
<code>  <span style="color: #F92672;">for</span> (<span style="color: #66D9EF;">int</span> <span style="color: #FD971F;">i</span>=0; i &lt;2 ; i++) {</code>
<code>    cout&lt;&lt;<span style="color: #E6DB74;">"int to char array, msg:"</span>&lt;&lt;msg[i]&lt;&lt;endl;  </code>
<code>  }</code>
<code></code>
<code></code>
<code>  s=lexical_cast&lt;<span style="color: #66D9EF;">int</span>&gt;(<span style="color: #E6DB74;">"3456"</span>);</code>
<code>  cout&lt;&lt;<span style="color: #E6DB74;">"int to string:"</span>&lt;&lt;s&lt;&lt;endl;</code>
<code></code>
<code>  <span style="color: #F92672;">try</span> {</code>
<code>    s=lexical_cast&lt;<span style="color: #66D9EF;">int</span>&gt;(<span style="color: #E6DB74;">"56.78"</span>);  <span style="color: #75715E;">// </span><span style="color: #75715E;">bad_lexical_cast</span></code>
<code>  } <span style="color: #F92672;">catch</span> (<span style="color: #66D9EF;">bad_lexical_cast</span> &amp;<span style="color: #FD971F;">e</span>) {</code>
<code>    cout&lt;&lt;<span style="color: #E6DB74;">"Exception caught: "</span>&lt;&lt;e.what()&lt;&lt;endl;</code>
<code>  }</code>
<code>  <span style="color: #F92672;">try</span>{</code>
<code>  s=lexical_cast&lt;<span style="color: #66D9EF;">int</span>&gt;(<span style="color: #E6DB74;">"3456yu"</span>);<span style="color: #75715E;">//</span><span style="color: #75715E;">bad_lexical_cast</span></code>
<code>  }<span style="color: #F92672;">catch</span>(<span style="color: #66D9EF;">bad_lexical_cast</span> &amp;<span style="color: #FD971F;">e</span>){</code>
<code>    cout&lt;&lt;<span style="color: #E6DB74;">"Exception caught: "</span>&lt;&lt;e.what()&lt;&lt;endl;</code>
<code>  }</code>
<code>  s=lexical_cast&lt;<span style="color: #66D9EF;">int</span>&gt;(<span style="color: #E6DB74;">"3456yu"</span>,4);</code>
<code>  cout&lt;&lt;s&lt;&lt;endl;</code>
<code>  <span style="color: #F92672;">return</span> 0;</code>
<code>} </code>
<code></code>
</pre>
</div>
</div>
</div>
