_drafts/boost.org
** variant
#+BEGIN_SRC C++ :exports_both
#include <vector>
#include <iostream>
#include "boost/variant.hpp"
using namespace std;
int main(int argc, char *argv[])
{
  //union
  union {int i; float f;} u;
  u.i=34;
  u.f=2.3;

  boost::variant<int,string> u1,u2;
  u1=2;
  u2="hello";
  cout<<u1<<" "<<u2<<endl;

  //u1=u1*2 error
  u1=boost::get<int>(u1)*2;

  try{
    string st=boost::get<string>(u1);  // throw exception of bad_get
  }catch(boost::bad_get &e){
    cout<<"Exception caught: "<<e.what()<<endl;
  }
  u1="good";  // u1 become a sting
  u1=32;      // u1 become a int again

  boost::variant<int,string> u3;
  cout<<u3<<endl;

  void Double(boost::variant<int,string> v);

  // using visitor
  class DoubleVisitor: public boost::static_visitor<>{
   public:
    void operator() (int& i) const {
      i+=i;
    }
    void operator() (string& str) const{
      str+=str;
    }
  };

  u1=2;
  boost::apply_visitor(DoubleVisitor(),u1);  // u1 become 4
  u2="hello";
  boost::apply_visitor(DoubleVisitor(),u2);  // u2 become "hellohello"
 
  std::vector<boost::variant<int,string>> vec;
  vec.push_back("good");
  vec.push_back(23);
  vec.push_back("bad");
  
  DoubleVisitor f;
  for(auto x: vec){
    boost::apply_visitor(f,x);
    cout<<x<<endl;
  }

  return 0;
}
#+END_SRC

#+RESULTS:
|         2 | hello   |                 |        |       |     |       |            |
| Exception | caught: | boost::bad_get: | failed | value | get | using | boost::get |
|         0 |         |                 |        |       |     |       |            |
|  goodgood |         |                 |        |       |     |       |            |
|        46 |         |                 |        |       |     |       |            |
|    badbad |         |                 |        |       |     |       |            |
