_posts/2019-08-31-boost.html
<div id="outline-container-orga7d22d6" class="outline-3">
<h3 id="orga7d22d6"><span class="section-number-3">6.2</span> variant</h3>
<div class="outline-text-3" id="text-6-2">
<div class="org-src-container">
<pre class="src src-C++"><code><span style="color: #F92672;">#include</span> <span style="color: #E6DB74;">&lt;vector&gt;</span></code>
<code><span style="color: #F92672;">#include</span> <span style="color: #E6DB74;">&lt;iostream&gt;</span></code>
<code><span style="color: #F92672;">#include</span> <span style="color: #E6DB74;">"boost/variant.hpp"</span></code>
<code><span style="color: #F92672;">using</span> <span style="color: #F92672;">namespace</span> <span style="color: #AE81FF;">std</span>;</code>
<code><span style="color: #66D9EF;">int</span> <span style="color: #A6E22E;">main</span>(<span style="color: #66D9EF;">int</span> <span style="color: #FD971F;">argc</span>, <span style="color: #66D9EF;">char</span> *<span style="color: #FD971F;">argv</span>[])</code>
<code>{</code>
<code>  <span style="color: #75715E;">//</span><span style="color: #75715E;">union</span></code>
<code>  <span style="color: #F92672;">union</span> {<span style="color: #66D9EF;">int</span> <span style="color: #FD971F;">i</span>; <span style="color: #66D9EF;">float</span> <span style="color: #FD971F;">f</span>;} <span style="color: #FD971F;">u</span>;</code>
<code>  u.i=34;</code>
<code>  u.f=2.3;</code>
<code></code>
<code>  <span style="color: #AE81FF;">boost</span>::<span style="color: #66D9EF;">variant</span>&lt;<span style="color: #66D9EF;">int</span>,<span style="color: #66D9EF;">string</span>&gt; <span style="color: #FD971F;">u1</span>,<span style="color: #FD971F;">u2</span>;</code>
<code>  u1=2;</code>
<code>  u2=<span style="color: #E6DB74;">"hello"</span>;</code>
<code>  cout&lt;&lt;u1&lt;&lt;<span style="color: #E6DB74;">" "</span>&lt;&lt;u2&lt;&lt;endl;</code>
<code></code>
<code>  <span style="color: #75715E;">//</span><span style="color: #75715E;">u1=u1*2 error</span></code>
<code>  u1=<span style="color: #AE81FF;">boost</span>::get&lt;<span style="color: #66D9EF;">int</span>&gt;(u1)*2;</code>
<code></code>
<code>  <span style="color: #F92672;">try</span>{</code>
<code>    <span style="color: #66D9EF;">string</span> <span style="color: #FD971F;">st</span>=<span style="color: #AE81FF;">boost</span>::get&lt;<span style="color: #66D9EF;">string</span>&gt;(u1);  <span style="color: #75715E;">// </span><span style="color: #75715E;">throw exception of bad_get</span></code>
<code>  }<span style="color: #F92672;">catch</span>(<span style="color: #AE81FF;">boost</span>::<span style="color: #66D9EF;">bad_get</span> &amp;<span style="color: #FD971F;">e</span>){</code>
<code>    cout&lt;&lt;<span style="color: #E6DB74;">"Exception caught: "</span>&lt;&lt;e.what()&lt;&lt;endl;</code>
<code>  }</code>
<code>  u1=<span style="color: #E6DB74;">"good"</span>;  <span style="color: #75715E;">// </span><span style="color: #75715E;">u1 become a sting</span></code>
<code>  u1=32;      <span style="color: #75715E;">// </span><span style="color: #75715E;">u1 become a int again</span></code>
<code></code>
<code>  <span style="color: #AE81FF;">boost</span>::<span style="color: #66D9EF;">variant</span>&lt;<span style="color: #66D9EF;">int</span>,<span style="color: #66D9EF;">string</span>&gt; <span style="color: #FD971F;">u3</span>;</code>
<code>  cout&lt;&lt;u3&lt;&lt;endl;</code>
<code></code>
<code>  <span style="color: #66D9EF;">void</span> <span style="color: #FD971F;">Double</span>(<span style="color: #AE81FF;">boost</span>::<span style="color: #66D9EF;">variant</span>&lt;<span style="color: #66D9EF;">int</span>,<span style="color: #66D9EF;">string</span>&gt; v);</code>
<code></code>
<code>  <span style="color: #75715E;">// </span><span style="color: #75715E;">using visitor</span></code>
<code>  <span style="color: #F92672;">class</span> <span style="color: #66D9EF;">DoubleVisitor</span>: <span style="color: #F92672;">public</span> <span style="color: #AE81FF;">boost</span>::<span style="color: #66D9EF;">static_visitor</span>&lt;&gt;{</code>
<code>   <span style="color: #F92672;">public</span>:</code>
<code>    <span style="color: #66D9EF;">void</span> <span style="color: #F92672;">operator</span><span style="color: #A6E22E;">()</span> (<span style="color: #66D9EF;">int</span>&amp; <span style="color: #FD971F;">i</span>) <span style="color: #F92672;">const</span> {</code>
<code>      i+=i;</code>
<code>    }</code>
<code>    <span style="color: #66D9EF;">void</span> <span style="color: #F92672;">operator</span><span style="color: #A6E22E;">()</span> (<span style="color: #66D9EF;">string</span>&amp; <span style="color: #FD971F;">str</span>) <span style="color: #F92672;">const</span>{</code>
<code>      str+=str;</code>
<code>    }</code>
<code>  };</code>
<code></code>
<code>  u1=2;</code>
<code>  <span style="color: #AE81FF;">boost</span>::apply_visitor(DoubleVisitor(),u1);  <span style="color: #75715E;">// </span><span style="color: #75715E;">u1 become 4</span></code>
<code>  u2=<span style="color: #E6DB74;">"hello"</span>;</code>
<code>  <span style="color: #AE81FF;">boost</span>::apply_visitor(DoubleVisitor(),u2);  <span style="color: #75715E;">// </span><span style="color: #75715E;">u2 become "hellohello"</span></code>
<code></code>
<code>  <span style="color: #AE81FF;">std</span>::<span style="color: #66D9EF;">vector</span>&lt;<span style="color: #AE81FF;">boost</span>::<span style="color: #66D9EF;">variant</span>&lt;<span style="color: #66D9EF;">int</span>,<span style="color: #66D9EF;">string</span>&gt;&gt; <span style="color: #FD971F;">vec</span>;</code>
<code>  vec.push_back(<span style="color: #E6DB74;">"good"</span>);</code>
<code>  vec.push_back(23);</code>
<code>  vec.push_back(<span style="color: #E6DB74;">"bad"</span>);</code>
<code></code>
<code>  <span style="color: #66D9EF;">DoubleVisitor</span> <span style="color: #FD971F;">f</span>;</code>
<code>  <span style="color: #F92672;">for</span>(<span style="color: #F92672;">auto</span> <span style="color: #FD971F;">x</span>: vec){</code>
<code>    <span style="color: #AE81FF;">boost</span>::apply_visitor(f,x);</code>
<code>    cout&lt;&lt;x&lt;&lt;endl;</code>
<code>  }</code>
<code></code>
<code>  <span style="color: #F92672;">return</span> 0;</code>
<code>}</code>
</pre>
</div>
</div>
</div>
