_posts/2019-08-31-boost.html
<div id="outline-container-org688d557" class="outline-3">
<h3 id="org688d557"><span class="section-number-3">6.3</span> Any</h3>
<div class="outline-text-3" id="text-6-3">
<div class="org-src-container">
<pre class="src src-C++"><code><span style="color: #F92672;">#include</span> <span style="color: #E6DB74;">&lt;vector&gt;</span></code>
<code><span style="color: #F92672;">#include</span> <span style="color: #E6DB74;">&lt;iostream&gt;</span></code>
<code><span style="color: #F92672;">#include</span> <span style="color: #E6DB74;">"boost/any.hpp"</span></code>
<code><span style="color: #F92672;">using</span> <span style="color: #F92672;">namespace</span> <span style="color: #AE81FF;">std</span>;</code>
<code><span style="color: #66D9EF;">int</span> <span style="color: #A6E22E;">main</span>(<span style="color: #66D9EF;">int</span> <span style="color: #FD971F;">argc</span>, <span style="color: #66D9EF;">char</span> *<span style="color: #FD971F;">argv</span>[])</code>
<code>{</code>
<code>  <span style="color: #AE81FF;">boost</span>::<span style="color: #66D9EF;">any</span> <span style="color: #FD971F;">x</span>,<span style="color: #FD971F;">y</span>,<span style="color: #FD971F;">z</span>;</code>
<code>  x=string(<span style="color: #E6DB74;">"hello"</span>);</code>
<code>  x=2.3;</code>
<code>  y=<span style="color: #E6DB74;">'z'</span>;</code>
<code>  z=vector&lt;<span style="color: #66D9EF;">int</span>&gt;();</code>
<code></code>
<code>  cout&lt;&lt;<span style="color: #AE81FF;">boost</span>::any_cast&lt;<span style="color: #66D9EF;">char</span>&gt;(y)&lt;&lt;endl;  <span style="color: #75715E;">// </span><span style="color: #75715E;">return a copy of y's data: 'z'</span></code>
<code>  cout&lt;&lt;<span style="color: #AE81FF;">boost</span>::any_cast&lt;<span style="color: #66D9EF;">double</span>&gt;(x)&lt;&lt;endl; <span style="color: #75715E;">// </span><span style="color: #75715E;">return a copy of x's data: 2.3</span></code>
<code>  <span style="color: #F92672;">try</span> {</code>
<code>    cout&lt;&lt;<span style="color: #AE81FF;">boost</span>::any_cast&lt;<span style="color: #66D9EF;">int</span>&gt;(x)&lt;&lt;endl;  <span style="color: #75715E;">// </span><span style="color: #75715E;">throws bad_cast_any</span></code>
<code>  } <span style="color: #F92672;">catch</span> (<span style="color: #AE81FF;">boost</span>::<span style="color: #66D9EF;">bad_any_cast</span>&amp; <span style="color: #FD971F;">e</span>) {</code>
<code>    cout&lt;&lt;<span style="color: #E6DB74;">"Exception: "</span>&lt;&lt;e.what()&lt;&lt;endl;</code>
<code>  }</code>
<code>  <span style="color: #F92672;">try</span> {</code>
<code>    cout&lt;&lt;<span style="color: #AE81FF;">boost</span>::any_cast&lt;<span style="color: #66D9EF;">float</span>&gt;(x)&lt;&lt;endl;  <span style="color: #75715E;">// </span><span style="color: #75715E;">throws bad_any_cast  </span></code>
<code>  } <span style="color: #F92672;">catch</span> (<span style="color: #AE81FF;">boost</span>::<span style="color: #66D9EF;">bad_any_cast</span>&amp; <span style="color: #FD971F;">e</span>) {</code>
<code>    cout&lt;&lt;<span style="color: #E6DB74;">"Exception: "</span>&lt;&lt;e.what()&lt;&lt;endl;</code>
<code>  }</code>
<code></code>
<code>  <span style="color: #F92672;">if</span>(x.empty())</code>
<code>    cout&lt;&lt;<span style="color: #E6DB74;">"x is empty"</span>&lt;&lt;endl;</code>
<code></code>
<code>  <span style="color: #F92672;">if</span>(x.type()==<span style="color: #F92672;">typeid</span>(<span style="color: #66D9EF;">char</span>))</code>
<code>    cout&lt;&lt;<span style="color: #E6DB74;">"x is char"</span>&lt;&lt;endl;</code>
<code></code>
<code>  <span style="color: #75715E;">/*</span><span style="color: #75715E;">This is the wrong use example</span></code>
<code><span style="color: #75715E;">  boost::any_cast&lt;vector&lt;int&gt;&gt;(z).push_back(23);</span></code>
<code><span style="color: #75715E;">  int i=boost::any_cast&lt;vector&lt;int&gt;&gt;(z).back();  // crash, becase boost::any_cast&lt;vector&lt;int&gt;&gt;(z) return a copy of variable z</span></code>
<code><span style="color: #75715E;">  */</span></code>
<code>  <span style="color: #66D9EF;">int</span> <span style="color: #FD971F;">i</span>;</code>
<code>  <span style="color: #AE81FF;">boost</span>::<span style="color: #66D9EF;">any</span> <span style="color: #FD971F;">p</span>=&amp;i;</code>
<code>  <span style="color: #66D9EF;">int</span>* <span style="color: #FD971F;">pInt</span>=<span style="color: #AE81FF;">boost</span>::any_cast&lt;<span style="color: #66D9EF;">int</span>*&gt;(p);  <span style="color: #75715E;">// </span><span style="color: #75715E;">returns a pointer</span></code>
<code></code>
<code>  <span style="color: #66D9EF;">vector</span>&lt;<span style="color: #AE81FF;">boost</span>::<span style="color: #66D9EF;">any</span>&gt; <span style="color: #FD971F;">m</span>;</code>
<code>  m.push_back(2);</code>
<code>  m.push_back(<span style="color: #E6DB74;">'a'</span>);</code>
<code>  m.push_back(p);</code>
<code>  m.push_back(<span style="color: #AE81FF;">boost</span>::any());</code>
<code></code>
<code>  <span style="color: #F92672;">struct</span> <span style="color: #66D9EF;">Property</span>{</code>
<code>    <span style="color: #66D9EF;">string</span> <span style="color: #FD971F;">name</span>;</code>
<code>    <span style="color: #AE81FF;">boost</span>::<span style="color: #66D9EF;">any</span> <span style="color: #FD971F;">value</span>;</code>
<code>  };</code>
<code></code>
<code>  <span style="color: #66D9EF;">vector</span>&lt;<span style="color: #66D9EF;">Property</span>&gt; <span style="color: #FD971F;">properties</span>;</code>
<code></code>
<code>  <span style="color: #F92672;">return</span> 0;</code>
<code>}</code>
<code></code>
</pre>
</div>
<ul class="org-ul">
<li>This is a common wrong use example</li>
</ul>
<div class="org-src-container">
<pre class="src src-C++"><code><span style="color: #AE81FF;">boost</span>::<span style="color: #66D9EF;">any</span> <span style="color: #FD971F;">z</span>;</code>
<code>z=vector&lt;<span style="color: #66D9EF;">int</span>&gt;();</code>
<code><span style="color: #AE81FF;">boost</span>::any_cast&lt;<span style="color: #66D9EF;">vector</span>&lt;<span style="color: #66D9EF;">int</span>&gt;&gt;(z).push_back(23);</code>
<code><span style="color: #66D9EF;">int</span> <span style="color: #FD971F;">i</span>=<span style="color: #AE81FF;">boost</span>::any_cast&lt;<span style="color: #66D9EF;">vector</span>&lt;<span style="color: #66D9EF;">int</span>&gt;&gt;(z).back();  <span style="color: #75715E;">// </span><span style="color: #75715E;">crash, becase boost::any_cast&lt;vector&lt;int&gt;&gt;(z) return a copy of variable z</span></code>
</pre>
</div>
</div>
</div>
