_posts/2019-08-31-boost.html
<div id="outline-container-orgb964102" class="outline-3">
<h3 id="orgb964102"><span class="section-number-3">6.4</span> optional</h3>
<div class="outline-text-3" id="text-6-4">
<div class="org-src-container">
<pre class="src src-C++"><code><span style="color: #F92672;">#include</span> <span style="color: #E6DB74;">"boost/optional.hpp"</span></code>
<code><span style="color: #F92672;">#include</span> <span style="color: #E6DB74;">"boost/variant.hpp"</span></code>
<code><span style="color: #F92672;">#include</span> <span style="color: #E6DB74;">&lt;iostream&gt;</span></code>
<code><span style="color: #F92672;">#include</span> <span style="color: #E6DB74;">&lt;vector&gt;</span></code>
<code><span style="color: #F92672;">#include</span> <span style="color: #E6DB74;">&lt;deque&gt;</span></code>
<code><span style="color: #F92672;">using</span> <span style="color: #F92672;">namespace</span> <span style="color: #AE81FF;">std</span>;</code>
<code></code>
<code><span style="color: #66D9EF;">deque</span>&lt;<span style="color: #66D9EF;">char</span>&gt; <span style="color: #FD971F;">queue</span>;</code>
<code></code>
<code><span style="color: #AE81FF;">boost</span>::<span style="color: #66D9EF;">optional</span>&lt;<span style="color: #66D9EF;">char</span>&gt;  <span style="color: #A6E22E;">get_async_data</span>(){</code>
<code>  <span style="color: #F92672;">if</span>(<span style="color: #E6DB74; font-weight: bold;">!</span>queue.empty())</code>
<code>    <span style="color: #F92672;">return</span> <span style="color: #AE81FF;">boost</span>::optional&lt;<span style="color: #66D9EF;">char</span>&gt;(queue.back());</code>
<code>  <span style="color: #F92672;">else</span></code>
<code>    <span style="color: #F92672;">return</span> <span style="color: #AE81FF;">boost</span>::optional&lt;<span style="color: #66D9EF;">char</span>&gt;();</code>
<code>}</code>
<code></code>
<code><span style="color: #66D9EF;">int</span> <span style="color: #A6E22E;">main</span>(<span style="color: #66D9EF;">int</span> <span style="color: #FD971F;">argc</span>, <span style="color: #66D9EF;">char</span> *<span style="color: #FD971F;">argv</span>[])</code>
<code>{</code>
<code>  <span style="color: #AE81FF;">boost</span>::<span style="color: #66D9EF;">variant</span>&lt;<span style="color: #66D9EF;">nullptr_t</span>, <span style="color: #66D9EF;">char</span>&gt; <span style="color: #FD971F;">v</span>;</code>
<code>  <span style="color: #AE81FF;">boost</span>::<span style="color: #66D9EF;">optional</span>&lt;<span style="color: #66D9EF;">char</span>&gt; <span style="color: #FD971F;">op</span>;  <span style="color: #75715E;">// </span><span style="color: #75715E;">op is uninitalized, no char is constructed</span></code>
<code>  op=<span style="color: #E6DB74;">'A'</span>;                    <span style="color: #75715E;">// </span><span style="color: #75715E;">op contains 'A'</span></code>
<code></code>
<code>  op=get_async_data();</code>
<code>  <span style="color: #F92672;">if</span>(<span style="color: #E6DB74; font-weight: bold;">!</span>op)</code>
<code>    cout&lt;&lt;<span style="color: #E6DB74;">"No data is available"</span>&lt;&lt;endl;</code>
<code>  <span style="color: #F92672;">else</span></code>
<code>  {</code>
<code>    cout&lt;&lt;<span style="color: #E6DB74;">"op contains: "</span>&lt;&lt;op.get()&lt;&lt;endl;  <span style="color: #75715E;">// </span><span style="color: #75715E;">get() will crash if op is uninitialized</span></code>
<code>    cout&lt;&lt;<span style="color: #E6DB74;">"op contains: "</span>&lt;&lt;*op&lt;&lt;endl;       <span style="color: #75715E;">// </span><span style="color: #75715E;">crash if op is uninitialized</span></code>
<code>  }</code>
<code></code>
<code>  op.reset();  <span style="color: #75715E;">// </span><span style="color: #75715E;">reset op uninitialized state</span></code>
<code>  cout&lt;&lt;op.get_value_or(<span style="color: #E6DB74;">'z'</span>)&lt;&lt;endl;  <span style="color: #75715E;">// </span><span style="color: #75715E;">return 'z' if op is empty</span></code>
<code></code>
<code>  <span style="color: #66D9EF;">char</span>* <span style="color: #FD971F;">p</span> =op.get_ptr();  <span style="color: #75715E;">// </span><span style="color: #75715E;">return null if op is empty</span></code>
<code></code>
<code>  <span style="color: #75715E;">//</span><span style="color: #75715E;">optional can store any kind of data</span></code>
<code>  <span style="color: #F92672;">struct</span> <span style="color: #66D9EF;">A</span>{<span style="color: #66D9EF;">string</span> <span style="color: #FD971F;">name</span>; <span style="color: #66D9EF;">int</span> <span style="color: #FD971F;">value</span>;};</code>
<code>  <span style="color: #66D9EF;">A</span> <span style="color: #FD971F;">a</span>;</code>
<code>  cout&lt;&lt;<span style="color: #E6DB74;">"a's name: "</span>&lt;&lt;a.name&lt;&lt;<span style="color: #E6DB74;">"a's value: "</span>&lt;&lt;a.value&lt;&lt;endl;</code>
<code></code>
<code>  <span style="color: #AE81FF;">boost</span>::<span style="color: #66D9EF;">optional</span>&lt;<span style="color: #66D9EF;">A</span>&gt; <span style="color: #FD971F;">opA0</span>;  <span style="color: #75715E;">// </span><span style="color: #75715E;">constructor of A is not called</span></code>
<code>  <span style="color: #AE81FF;">boost</span>::<span style="color: #66D9EF;">optional</span>&lt;<span style="color: #66D9EF;">A</span>&gt; <span style="color: #FD971F;">opA</span>(a);  <span style="color: #75715E;">// </span><span style="color: #75715E;">a is copy constructed into opA</span></code>
<code>  cout&lt;&lt;opA-&gt;name&lt;&lt;<span style="color: #E6DB74;">" "</span>&lt;&lt;opA-&gt;value&lt;&lt;endl;</code>
<code></code>
<code>  <span style="color: #75715E;">//</span><span style="color: #75715E;">Pointer</span></code>
<code>  <span style="color: #AE81FF;">boost</span>::<span style="color: #66D9EF;">optional</span>&lt;<span style="color: #66D9EF;">A</span>*&gt; <span style="color: #FD971F;">opAP</span>(&amp;a);</code>
<code>  (*opAP)-&gt;name=<span style="color: #E6DB74;">"Bob"</span>;</code>
<code></code>
<code>  <span style="color: #75715E;">//</span><span style="color: #75715E;">Reference</span></code>
<code>  <span style="color: #AE81FF;">boost</span>::<span style="color: #66D9EF;">optional</span>&lt;<span style="color: #66D9EF;">A</span>&amp;&gt; <span style="color: #FD971F;">opAR</span>(a);</code>
<code>  opAR-&gt;name=<span style="color: #E6DB74;">"Bob"</span>;  <span style="color: #75715E;">// </span><span style="color: #75715E;">this changes a.name</span></code>
<code></code>
<code>  <span style="color: #75715E;">//</span><span style="color: #75715E;">Relational Operator</span></code>
<code>  <span style="color: #AE81FF;">boost</span>::<span style="color: #66D9EF;">optional</span>&lt;<span style="color: #66D9EF;">int</span>&gt; <span style="color: #FD971F;">i1</span>(1);</code>
<code>  <span style="color: #AE81FF;">boost</span>::<span style="color: #66D9EF;">optional</span>&lt;<span style="color: #66D9EF;">int</span>&gt; <span style="color: #FD971F;">i2</span>(9);</code>
<code>  <span style="color: #AE81FF;">boost</span>::<span style="color: #66D9EF;">optional</span>&lt;<span style="color: #66D9EF;">int</span>&gt; <span style="color: #FD971F;">i3</span>;</code>
<code>  <span style="color: #F92672;">if</span>(i1&lt;i2)</code>
<code>    cout&lt;&lt;<span style="color: #E6DB74;">"i2 is bigger"</span>&lt;&lt;endl;  <span style="color: #75715E;">// </span><span style="color: #75715E;">if both are initialized, *i1&lt;*i2, i3 is uninitialized which is samll than the initialized value</span></code>
<code></code>
<code>  <span style="color: #F92672;">return</span> 0;</code>
<code>}</code>
<code></code>
</pre>
</div>
</div>
</div>
</div>


<div id="outline-container-org18bcaef" class="outline-2">
<h2 id="org18bcaef"><span class="section-number-2">7</span> Parallel Programming</h2>
<div class="outline-text-2" id="text-7">
</div>
<div id="outline-container-orgd70fadb" class="outline-3">
<h3 id="orgd70fadb"><span class="section-number-3">7.1</span> Boost.Thread</h3>
<div class="outline-text-3" id="text-7-1">
<div class="org-src-container">
<pre class="src src-c++"><code><span style="color: #F92672;">#include</span> <span style="color: #E6DB74;">&lt;boost/thread.hpp&gt;</span></code>
<code><span style="color: #F92672;">#include</span> <span style="color: #E6DB74;">&lt;boost/chrono.hpp&gt;</span></code>
<code><span style="color: #F92672;">#include</span> <span style="color: #E6DB74;">&lt;iostream&gt;</span></code>
<code></code>
<code><span style="color: #66D9EF;">void</span> <span style="color: #A6E22E;">wait</span>(<span style="color: #66D9EF;">int</span> <span style="color: #FD971F;">seconds</span>)</code>
<code>{</code>
<code>  <span style="color: #AE81FF;">boost</span>::<span style="color: #AE81FF;">this_thread</span>::sleep_for(<span style="color: #AE81FF;">boost</span>::<span style="color: #AE81FF;">chrono</span>::seconds{seconds});</code>
<code>}</code>
<code></code>
<code><span style="color: #66D9EF;">void</span> <span style="color: #A6E22E;">thread</span>()</code>
<code>{</code>
<code>  <span style="color: #F92672;">for</span> (<span style="color: #66D9EF;">int</span> <span style="color: #FD971F;">i</span> = 0; i &lt; 5; ++i)</code>
<code>  {</code>
<code>    wait(1);</code>
<code>    <span style="color: #AE81FF;">std</span>::cout &lt;&lt; i &lt;&lt; <span style="color: #E6DB74;">'\n'</span>;</code>
<code>  }</code>
<code>}</code>
<code></code>
<code><span style="color: #66D9EF;">int</span> <span style="color: #A6E22E;">main</span>()</code>
<code>{</code>
<code>  <span style="color: #AE81FF;">boost</span>::<span style="color: #66D9EF;">thread</span> <span style="color: #FD971F;">t</span>{thread};</code>
<code>  t.join();</code>
<code>}</code>
</pre>
</div>
</div>
</div>
