_posts/2019-08-31-boost.html

<div id="outline-container-orga274b6d" class="outline-3">
<h3 id="orga274b6d"><span class="section-number-3">7.2</span> Boost.Atomic</h3>
<div class="outline-text-3" id="text-7-2">
<div class="org-src-container">
<pre class="src src-c++"><code><span style="color: #F92672;">#include</span> <span style="color: #E6DB74;">&lt;boost/atomic.hpp&gt;</span></code>
<code><span style="color: #F92672;">#include</span> <span style="color: #E6DB74;">&lt;thread&gt;</span></code>
<code><span style="color: #F92672;">#include</span> <span style="color: #E6DB74;">&lt;iostream&gt;</span></code>
<code></code>
<code><span style="color: #AE81FF;">boost</span>::<span style="color: #66D9EF;">atomic</span>&lt;<span style="color: #66D9EF;">int</span>&gt; <span style="color: #FD971F;">a</span>{0};</code>
<code></code>
<code><span style="color: #66D9EF;">void</span> <span style="color: #A6E22E;">thread</span>()</code>
<code>{</code>
<code>  ++a;</code>
<code>}</code>
<code></code>
<code><span style="color: #66D9EF;">int</span> <span style="color: #A6E22E;">main</span>()</code>
<code>{</code>
<code>  <span style="color: #AE81FF;">std</span>::<span style="color: #66D9EF;">thread</span> <span style="color: #FD971F;">t1</span>{thread};</code>
<code>  <span style="color: #AE81FF;">std</span>::<span style="color: #66D9EF;">thread</span> <span style="color: #FD971F;">t2</span>{thread};</code>
<code>  t1.join();</code>
<code>  t2.join();</code>
<code>  <span style="color: #AE81FF;">std</span>::cout &lt;&lt; a &lt;&lt; <span style="color: #E6DB74;">'\n'</span>;</code>
<code>}</code>
</pre>
</div>

<p>
With lock free
</p>
<div class="org-src-container">
<pre class="src src-cpp"><code><span style="color: #F92672;">#include</span> <span style="color: #E6DB74;">&lt;boost/atomic.hpp&gt;</span></code>
<code><span style="color: #F92672;">#include</span> <span style="color: #E6DB74;">&lt;iostream&gt;</span></code>
<code></code>
<code><span style="color: #66D9EF;">int</span> <span style="color: #A6E22E;">main</span>()</code>
<code>{</code>
<code>  <span style="color: #AE81FF;">std</span>::cout.setf(<span style="color: #AE81FF;">std</span>::<span style="color: #AE81FF;">ios</span>::boolalpha);</code>
<code></code>
<code>  <span style="color: #AE81FF;">boost</span>::<span style="color: #66D9EF;">atomic</span>&lt;<span style="color: #66D9EF;">short</span>&gt; <span style="color: #FD971F;">s</span>;</code>
<code>  <span style="color: #AE81FF;">std</span>::cout &lt;&lt; s.is_lock_free() &lt;&lt; <span style="color: #E6DB74;">'\n'</span>;</code>
<code></code>
<code>  <span style="color: #AE81FF;">boost</span>::<span style="color: #66D9EF;">atomic</span>&lt;<span style="color: #66D9EF;">int</span>&gt; <span style="color: #FD971F;">i</span>;</code>
<code>  <span style="color: #AE81FF;">std</span>::cout &lt;&lt; i.is_lock_free() &lt;&lt; <span style="color: #E6DB74;">'\n'</span>;</code>
<code></code>
<code>  <span style="color: #AE81FF;">boost</span>::<span style="color: #66D9EF;">atomic</span>&lt;<span style="color: #66D9EF;">long</span>&gt; <span style="color: #FD971F;">l</span>;</code>
<code>  <span style="color: #AE81FF;">std</span>::cout &lt;&lt; l.is_lock_free() &lt;&lt; <span style="color: #E6DB74;">'\n'</span>;</code>
<code>}</code>
</pre>
</div>
</div>
</div>
</div>
